
## Plan Result (prod)




<pre><code>Plan: 6 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_api_diagnostic.apim_bulk_scanning_payments_logs
  * module.cft_api_mgmt_oauth2_api.azurerm_api_management_api.api
  * module.cft_api_mgmt_oauth2_api.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_oauth2_policy.azurerm_api_management_api_policy.api_policy
  * module.cft_api_mgmt_oauth2_product.azurerm_api_management_product.product
  * module.cft_api_mgmt_oauth2_product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
* Update
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_diagnostic.apim_bulk_scanning_payments_logs will be created
  + resource "azurerm_api_management_api_diagnostic" "apim_bulk_scanning_payments_logs" {
      + always_log_errors         = true
      + api_management_logger_id  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/loggers/cft-api-mgmt-prod-logger"
      + api_management_name       = "cft-api-mgmt-prod"
      + api_name                  = "bulk-scanning-payments-api"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "cft-prod-network-rg"
      + sampling_percentage       = 100
      + verbosity                 = "verbose"

      + backend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + backend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }
    }

  # azurerm_api_management_subscription.exela_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/6dba11e4-d5da-4ca9-ba42-0a965df14a53"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_bulk_scan_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/d76fb7ae-abfe-438c-a7d3-d74764ca08b4"
        # (10 unchanged attributes hidden)
    }

  # module.cft_api_mgmt_oauth2_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "Bulk Scanning Payments API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "bulk-scanning-payments-api"
      + path                  = "bulk-scanning-payments"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-prod-network-rg"
      + revision              = "2"
      + service_url           = "http://ccpay-bulkscanning-api-prod.service.core-compute-prod.internal"
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/ccpay-payment-app.bulk-scanning.json"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.cft_api_mgmt_oauth2_api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "bulk-scanning-payments-api"
      + id                  = (known after apply)
      + product_id          = "bulk-scanning-payments"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.cft_api_mgmt_oauth2_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "bulk-scanning-payments-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <validate-azure-ad-token header-name="Authorization" tenant-id="531ff96d-0ae9-462a-8d2d-bec7c0b42082" failed-validation-httpcode="401" failed-validation-error-message="Unauthorized. Access token is missing or invalid.">
                  <client-application-ids>
                    <application-id>09afe796-358a-4e41-b06d-c5055df7e221</application-id>
                  </client-application-ids>
                  <audiences>
                    <audience>f5f3bb42-8bb4-4b0d-8895-2acd790df67a</audience>
                  </audiences>
                </validate-azure-ad-token>
                <!-- remove OAuth2 Authorization header -->
                <set-header name="Authorization" exists-action="delete" />
                <!-- generate totp -->
                <set-variable name="client_id" value="api_gw" />
                <set-variable name="client_secret" value="JBSAAHPPEHPK3PXP" />
                <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = &quot;ABCDEFGHIJKLMNOPQRSTUVWXYZ234567&quot;;
                            var bits = &quot;JBSAAHPPEHPK3PXP&quot;.ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] &amp; 0xf;
                            int truncatedHash = hash[offset] &amp; 0x7f;
                            for (int i = 1; i &lt; 4; i++)
                            {
                                truncatedHash &lt;&lt;= 8;
                                truncatedHash |= hash[offset + i] &amp; 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString(&quot;D6&quot;);
                        }"/>
                <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                  <set-url>http://rpe-service-auth-provider-prod.service.core-compute-prod.internal/lease</set-url>
                  <set-method>POST</set-method>
                  <set-header name="Content-Type" exists-action="override">
                    <value>application/json</value>
                  </set-header>
                  <set-body>@{
                    return new JObject(
                    new JProperty("microservice", (string)context.Variables["client_id"]),
                    new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                    ).ToString();
                    }</set-body>
                </send-request>
                <set-header name="ServiceAuthorization" exists-action="override">
                  <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
                </set-header>
              </inbound>
              <outbound>
                <base/>
              </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

  # module.cft_api_mgmt_oauth2_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-prod"
      + approval_required     = false
      + display_name          = "bulk-scanning-payments"
      + id                    = (known after apply)
      + product_id            = "bulk-scanning-payments"
      + published             = true
      + resource_group_name   = "cft-prod-network-rg"
      + subscription_required = false
      + subscriptions_limit   = 20
    }

  # module.cft_api_mgmt_oauth2_product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-prod"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "bulk-scanning-payments"
      + resource_group_name = "cft-prod-network-rg"
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":575,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->